var min_student = {
  "任宗浩": {
    "name": "任宗浩",
    "result": [
      "肾病",
      "急诊",
      "急诊",
      "ICU",
      "心病科",
      "心病科",
      "肺病科",
      "肝胆脾胃病科",
      "脑病科",
      "zanwei"
    ],
    "last": [
      "内分泌",
      "zanwei"
    ]
  },
  "张开波": {
    "name": "张开波",
    "result": [
      "内分泌",
      "急诊",
      "急诊",
      "ICU",
      "心病科",
      "心病科",
      "肺病科",
      "肾病",
      "脑病科",
      "zanwei"
    ],
    "last": [
      "肝胆脾胃病科",
      "zanwei"
    ]
  },
  "李治兵": {
    "name": "李治兵",
    "result": [
      "急诊",
      "急诊",
      "ICU",
      "脑病科",
      "内分泌",
      "肾病",
      "肺病科",
      "肝胆脾胃病科",
      "zanwei",
      "zanwei"
    ],
    "last": [
      "心病科",
      "心病科",
      "zanwei"
    ]
  },
  "张璐鹏": {
    "name": "张璐鹏",
    "result": [
      "内分泌",
      "急诊",
      "急诊",
      "ICU",
      "心病科",
      "心病科",
      "肺病科",
      "肾病",
      "脑病科",
      "zanwei"
    ],
    "last": [
      "肝胆脾胃病科",
      "zanwei"
    ]
  },
  "陈梦利": {
    "name": "陈梦利",
    "result": [
      "内分泌",
      "ICU",
      "急诊",
      "急诊",
      "心病科",
      "心病科",
      "肺病科",
      "肝胆脾胃病科",
      "脑病科",
      "肾病"
    ],
    "last": [
      "zanwei"
    ]
  },
  "邵帅": {
    "name": "邵帅",
    "result": [
      "内分泌",
      "ICU",
      "急诊",
      "急诊",
      "心病科",
      "心病科",
      "肺病科",
      "肝胆脾胃病科",
      "脑病科",
      "肾病"
    ],
    "last": [
      "zanwei"
    ]
  },
  "康研": {
    "name": "康研",
    "result": [
      "内分泌",
      "肝胆脾胃病科",
      "急诊",
      "急诊",
      "心病科",
      "心病科",
      "肾病",
      "脑病科",
      "ICU",
      "肺病科"
    ],
    "last": [
      "zanwei"
    ]
  },
  "李方方": {
    "name": "李方方",
    "result": [
      "内分泌",
      "肝胆脾胃病科",
      "急诊",
      "急诊",
      "心病科",
      "心病科",
      "肾病",
      "ICU",
      "肺病科",
      "zanwei"
    ],
    "last": [
      "脑病科",
      "zanwei"
    ]
  },
  "成家宏": {
    "name": "成家宏",
    "result": [
      "心病科",
      "心病科",
      "急诊",
      "急诊",
      "ICU",
      "肾病",
      "脑病科",
      "肝胆脾胃病科",
      "肺病科",
      "zanwei"
    ],
    "last": [
      "内分泌",
      "zanwei"
    ]
  },
  "邢玉凤": {
    "name": "邢玉凤",
    "result": [
      "心病科",
      "心病科",
      "急诊",
      "急诊",
      "ICU",
      "内分泌",
      "脑病科",
      "肝胆脾胃病科",
      "肺病科",
      "zanwei"
    ],
    "last": [
      "肾病",
      "zanwei"
    ]
  },
  "马瑞红": {
    "name": "马瑞红",
    "result": [
      "心病科",
      "心病科",
      "急诊",
      "急诊",
      "ICU",
      "内分泌",
      "肾病",
      "肺病科",
      "肝胆脾胃病科",
      "zanwei"
    ],
    "last": [
      "脑病科",
      "zanwei"
    ]
  },
  "侯学文": {
    "name": "侯学文",
    "result": [
      "心病科",
      "心病科",
      "ICU",
      "急诊",
      "急诊",
      "内分泌",
      "脑病科",
      "肾病",
      "肝胆脾胃病科",
      "zanwei"
    ],
    "last": [
      "肺病科",
      "zanwei"
    ]
  },
  "朱丹娜": {
    "name": "朱丹娜",
    "result": [
      "心病科",
      "心病科",
      "ICU",
      "急诊",
      "急诊",
      "内分泌",
      "脑病科",
      "zanwei",
      "肝胆脾胃病科",
      "肾病"
    ],
    "last": [
      "肺病科",
      "zanwei"
    ]
  },
  "崔艳粉": {
    "name": "崔艳粉",
    "result": [
      "心病科",
      "心病科",
      "ICU",
      "急诊",
      "急诊",
      "内分泌",
      "肝胆脾胃病科",
      "肺病科",
      "肾病",
      "zanwei"
    ],
    "last": [
      "脑病科",
      "zanwei"
    ]
  },
  "张创业": {
    "name": "张创业",
    "result": [
      "心病科",
      "心病科",
      "ICU",
      "急诊",
      "急诊",
      "内分泌",
      "肝胆脾胃病科",
      "肺病科",
      "肾病",
      "zanwei"
    ],
    "last": [
      "脑病科",
      "zanwei"
    ]
  },
  "孟六阳": {
    "name": "孟六阳",
    "result": [
      "心病科",
      "心病科",
      "ICU",
      "肾病",
      "急诊",
      "急诊",
      "肝胆脾胃病科",
      "内分泌",
      "肺病科",
      "zanwei"
    ],
    "last": [
      "脑病科",
      "zanwei"
    ]
  },
  "张迪": {
    "name": "张迪",
    "result": [
      "脑病科",
      "肺病科",
      "肝胆脾胃病科",
      "ICU",
      "急诊",
      "急诊",
      "内分泌",
      "zanwei",
      "肾病",
      "zanwei"
    ],
    "last": [
      "心病科",
      "心病科",
      "zanwei"
    ]
  },
  "潘海涛": {
    "name": "潘海涛",
    "result": [
      "脑病科",
      "肝胆脾胃病科",
      "肾病",
      "ICU",
      "急诊",
      "急诊",
      "内分泌",
      "肺病科",
      "zanwei",
      "zanwei"
    ],
    "last": [
      "心病科",
      "心病科",
      "zanwei"
    ]
  },
  "赵永华": {
    "name": "赵永华",
    "result": [
      "脑病科",
      "肺病科",
      "心病科",
      "心病科",
      "急诊",
      "急诊",
      "ICU",
      "内分泌",
      "zanwei",
      "zanwei"
    ],
    "last": [
      "肝胆脾胃病科",
      "肾病",
      "zanwei"
    ]
  },
  "张超": {
    "name": "张超",
    "result": [
      "脑病科",
      "ICU",
      "肝胆脾胃病科",
      "肾病",
      "急诊",
      "急诊",
      "内分泌",
      "肺病科",
      "zanwei",
      "zanwei"
    ],
    "last": [
      "心病科",
      "心病科",
      "zanwei"
    ]
  },
  "刘建申": {
    "name": "刘建申",
    "result": [
      "脑病科",
      "肺病科",
      "肝胆脾胃病科",
      "ICU",
      "急诊",
      "急诊",
      "内分泌",
      "zanwei",
      "zanwei",
      "zanwei"
    ],
    "last": [
      "心病科",
      "心病科",
      "肾病",
      "zanwei"
    ]
  },
  "莫万灵": {
    "name": "莫万灵",
    "result": [
      "脑病科",
      "肾病",
      "心病科",
      "心病科",
      "急诊",
      "急诊",
      "ICU",
      "内分泌",
      "肺病科",
      "zanwei"
    ],
    "last": [
      "肝胆脾胃病科",
      "zanwei"
    ]
  },
  "胡颖": {
    "name": "胡颖",
    "result": [
      "脑病科",
      "急诊",
      "急诊",
      "肾病",
      "心病科",
      "心病科",
      "肝胆脾胃病科",
      "ICU",
      "肺病科",
      "zanwei"
    ],
    "last": [
      "内分泌",
      "zanwei"
    ]
  },
  "贺群慧": {
    "name": "贺群慧",
    "result": [
      "脑病科",
      "内分泌",
      "肝胆脾胃病科",
      "肺病科",
      "ICU",
      "急诊",
      "急诊",
      "zanwei",
      "zanwei",
      "zanwei"
    ],
    "last": [
      "心病科",
      "心病科",
      "肾病",
      "zanwei"
    ]
  },
  "王露": {
    "name": "王露",
    "result": [
      "脑病科",
      "血液",
      "心病科",
      "心病科",
      "ICU",
      "急诊",
      "急诊",
      "内分泌",
      "zanwei",
      "肺病科"
    ],
    "last": [
      "肝胆脾胃病科",
      "肾病",
      "zanwei"
    ]
  },
  "段启": {
    "name": "段启",
    "result": [
      "肝胆脾胃病科",
      "内分泌",
      "心病科",
      "心病科",
      "ICU",
      "急诊",
      "急诊",
      "脑病科",
      "zanwei",
      "肺病科"
    ],
    "last": [
      "肾病",
      "zanwei"
    ]
  },
  "代云": {
    "name": "代云",
    "result": [
      "肝胆脾胃病科",
      "肺病科",
      "心病科",
      "心病科",
      "内分泌",
      "急诊",
      "急诊",
      "ICU",
      "zanwei",
      "zanwei"
    ],
    "last": [
      "脑病科",
      "肾病",
      "zanwei"
    ]
  },
  "王棣丞": {
    "name": "王棣丞",
    "result": [
      "肝胆脾胃病科",
      "ICU",
      "肾病",
      "脑病科",
      "内分泌",
      "肺病科",
      "急诊",
      "急诊",
      "zanwei",
      "zanwei"
    ],
    "last": [
      "心病科",
      "心病科",
      "zanwei"
    ]
  },
  "任闪闪": {
    "name": "任闪闪",
    "result": [
      "肝胆脾胃病科",
      "肾病",
      "心病科",
      "心病科",
      "内分泌",
      "肺病科",
      "急诊",
      "急诊",
      "ICU",
      "zanwei"
    ],
    "last": [
      "脑病科",
      "zanwei"
    ]
  },
  "李锋森": {
    "name": "李锋森",
    "result": [
      "肝胆脾胃病科",
      "脑病科",
      "心病科",
      "心病科",
      "肾病",
      "肺病科",
      "急诊",
      "急诊",
      "ICU",
      "zanwei"
    ],
    "last": [
      "内分泌",
      "zanwei"
    ]
  },
  "范莹莹": {
    "name": "范莹莹",
    "result": [
      "肝胆脾胃病科",
      "内分泌",
      "心病科",
      "心病科",
      "肾病",
      "肺病科",
      "急诊",
      "急诊",
      "ICU",
      "zanwei"
    ],
    "last": [
      "脑病科",
      "zanwei"
    ]
  },
  "李登科": {
    "name": "李登科",
    "result": [
      "肝胆脾胃病科",
      "内分泌",
      "心病科",
      "心病科",
      "脑病科",
      "肾病",
      "急诊",
      "急诊",
      "ICU",
      "肺病科"
    ],
    "last": [
      "zanwei"
    ]
  },
  "介睿峥": {
    "name": "介睿峥",
    "result": [
      "肺病科",
      "内分泌",
      "肝胆脾胃病科",
      "脑病科",
      "心病科",
      "心病科",
      "急诊",
      "急诊",
      "ICU",
      "zanwei"
    ],
    "last": [
      "肾病",
      "zanwei"
    ]
  },
  "苏珊珊": {
    "name": "苏珊珊",
    "result": [
      "肺病科",
      "ICU",
      "肝胆脾胃病科",
      "脑病科",
      "肾病",
      "zanwei",
      "急诊",
      "急诊",
      "心病科",
      "心病科"
    ],
    "last": [
      "内分泌",
      "zanwei"
    ]
  },
  "邱月清": {
    "name": "邱月清",
    "result": [
      "肺病科",
      "肾病",
      "脑病科",
      "肝胆脾胃病科",
      "内分泌",
      "ICU",
      "zanwei",
      "急诊",
      "急诊",
      "zanwei"
    ],
    "last": [
      "心病科",
      "心病科",
      "zanwei"
    ]
  },
  "李英宵": {
    "name": "李英宵",
    "result": [
      "肺病科",
      "脑病科",
      "肾病",
      "内分泌",
      "zanwei",
      "ICU",
      "心病科",
      "心病科",
      "急诊",
      "急诊"
    ],
    "last": [
      "肝胆脾胃病科",
      "zanwei"
    ]
  },
  "樊亚芳": {
    "name": "樊亚芳",
    "result": [
      "肺病科",
      "脑病科",
      "内分泌",
      "zanwei",
      "zanwei",
      "ICU",
      "心病科",
      "心病科",
      "急诊",
      "急诊"
    ],
    "last": [
      "肝胆脾胃病科",
      "肾病",
      "zanwei"
    ]
  },
  "李习婉": {
    "name": "李习婉",
    "result": [
      "急诊",
      "急诊",
      "脑病科",
      "肝胆脾胃病科",
      "内分泌",
      "肺病科",
      "ICU",
      "zanwei",
      "zanwei",
      "zanwei"
    ],
    "last": [
      "心病科",
      "心病科",
      "肾病",
      "zanwei"
    ]
  },
  "王若凡": {
    "name": "王若凡",
    "result": [
      "急诊",
      "急诊",
      "脑病科",
      "肝胆脾胃病科",
      "肺病科",
      "ICU",
      "心病科",
      "心病科",
      "zanwei",
      "zanwei"
    ],
    "last": [
      "肾病",
      "内分泌",
      "zanwei"
    ]
  },
  "李倩倩": {
    "name": "李倩倩",
    "result": [
      "急诊",
      "急诊",
      "脑病科",
      "内分泌",
      "肺病科",
      "ICU",
      "心病科",
      "心病科",
      "zanwei",
      "zanwei"
    ],
    "last": [
      "肝胆脾胃病科",
      "肾病",
      "zanwei"
    ]
  },
  "任娟": {
    "name": "任娟",
    "result": [
      "急诊",
      "急诊",
      "脑病科",
      "肝胆脾胃病科",
      "肺病科",
      "ICU",
      "心病科",
      "心病科",
      "zanwei",
      "zanwei"
    ],
    "last": [
      "肾病",
      "内分泌",
      "zanwei"
    ]
  },
  "张鑫丽": {
    "name": "张鑫丽",
    "result": [
      "急诊",
      "急诊",
      "肺病科",
      "脑病科",
      "zanwei",
      "zanwei",
      "心病科",
      "心病科",
      "内分泌",
      "ICU"
    ],
    "last": [
      "肝胆脾胃病科",
      "肾病",
      "zanwei"
    ]
  },
  "袁成凤": {
    "name": "袁成凤",
    "result": [
      "急诊",
      "急诊",
      "肺病科",
      "肝胆脾胃病科",
      "脑病科",
      "zanwei",
      "心病科",
      "心病科",
      "zanwei",
      "ICU"
    ],
    "last": [
      "肾病",
      "内分泌",
      "zanwei"
    ]
  },
  "郑璐璐": {
    "name": "郑璐璐",
    "result": [
      "ICU",
      "脑病科",
      "肺病科",
      "内分泌",
      "zanwei",
      "zanwei",
      "心病科",
      "心病科",
      "急诊",
      "急诊"
    ],
    "last": [
      "肝胆脾胃病科",
      "肾病",
      "zanwei"
    ]
  },
  "娄方敏": {
    "name": "娄方敏",
    "result": [
      "ICU",
      "内分泌",
      "肺病科",
      "zanwei",
      "脑病科",
      "zanwei",
      "心病科",
      "心病科",
      "急诊",
      "急诊"
    ],
    "last": [
      "肝胆脾胃病科",
      "肾病",
      "zanwei"
    ]
  },
  "叶子": {
    "name": "叶子",
    "result": [
      "ICU",
      "肺病科",
      "zanwei",
      "肝胆脾胃病科",
      "脑病科",
      "zanwei",
      "zanwei",
      "急诊",
      "急诊",
      "心病科"
    ],
    "last": [
      "心病科",
      "肾病",
      "内分泌",
      "zanwei"
    ]
  },
  "王红艳": {
    "name": "王红艳",
    "result": [
      "ICU",
      "血液",
      "肺病科",
      "zanwei",
      "脑病科",
      "肝胆脾胃病科",
      "zanwei",
      "急诊",
      "急诊",
      "心病科"
    ],
    "last": [
      "心病科",
      "肾病",
      "内分泌",
      "zanwei"
    ]
  },
  "张亚乐": {
    "name": "张亚乐",
    "result": [
      "肾病",
      "内分泌",
      "肺病科",
      "zanwei",
      "肝胆脾胃病科",
      "脑病科",
      "ICU",
      "急诊",
      "急诊",
      "心病科"
    ],
    "last": [
      "心病科",
      "zanwei"
    ]
  },
  "黄爱娟": {
    "name": "黄爱娟",
    "result": [
      "肾病",
      "ICU",
      "zanwei",
      "肺病科",
      "肝胆脾胃病科",
      "脑病科",
      "zanwei",
      "zanwei",
      "急诊",
      "急诊"
    ],
    "last": [
      "心病科",
      "心病科",
      "内分泌",
      "zanwei"
    ]
  },
  "吉兰洁": {
    "name": "吉兰洁",
    "result": [
      "肾病",
      "内分泌",
      "zanwei",
      "肺病科",
      "肝胆脾胃病科",
      "脑病科",
      "ICU",
      "zanwei",
      "急诊",
      "急诊"
    ],
    "last": [
      "心病科",
      "心病科",
      "zanwei"
    ]
  },
  "李颖": {
    "name": "李颖",
    "result": [
      "血液",
      "肝胆脾胃病科",
      "内分泌",
      "肺病科",
      "zanwei",
      "zanwei",
      "ICU",
      "zanwei",
      "急诊",
      "急诊"
    ],
    "last": [
      "心病科",
      "心病科",
      "脑病科",
      "肾病",
      "zanwei"
    ]
  },
  "张静晓": {
    "name": "张静晓",
    "result": [
      "血液",
      "脑病科",
      "内分泌",
      "肺病科",
      "zanwei",
      "zanwei",
      "zanwei",
      "ICU",
      "急诊",
      "急诊"
    ],
    "last": [
      "心病科",
      "心病科",
      "肝胆脾胃病科",
      "肾病",
      "zanwei"
    ]
  },
  "袁帆": {
    "name": "袁帆",
    "result": [
      "内分泌",
      "血液",
      "zanwei",
      "肺病科",
      "肝胆脾胃病科",
      "脑病科",
      "zanwei",
      "ICU",
      "急诊",
      "急诊"
    ],
    "last": [
      "心病科",
      "心病科",
      "肾病",
      "zanwei"
    ]
  },
  "侯露阳": {
    "name": "侯露阳",
    "result": [
      "内分泌",
      "肝胆脾胃病科",
      "zanwei",
      "zanwei",
      "肺病科",
      "zanwei",
      "zanwei",
      "ICU",
      "急诊",
      "急诊"
    ],
    "last": [
      "心病科",
      "心病科",
      "脑病科",
      "肾病",
      "zanwei"
    ]
  }
}